Revit 2024 API
EnergyDataSettings.SliverSpaceTolerance Property
 Used for Detailed GreenBuildingXML export. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double SliverSpaceTolerance { get; set; }
Visual Basic
Public Property SliverSpaceTolerance As Double
	Get
	Set
Visual C++
public:
property double SliverSpaceTolerance {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The sliver space tolerance is less than zero.
See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace